{
  "HolonomicID": "scpn://atlas.v1/D1.Astrocyte",
  "ParentID": "scpn://atlas.v1/D5.Organism",
  "Classical": {
    "Structure": "A star-shaped glial cell in the Central Nervous System. Ensheathes synapses ('tripartite synapse') and connects to blood vessels.",
    "Function": "Performs numerous homeostatic functions: neurotransmitter reuptake (esp. glutamate), metabolic support (lactate shuttle), blood-brain barrier maintenance, and synaptic pruning.",
    "Pathology": "Astrogliosis (scarring), linked to epilepsy, neurodegeneration, and CNS trauma."
  },
  "SCPN": {
    "L1_QuantumBiological": "Astrocyte networks (syncytium) connected by gap junctions may form large-scale L1 coherent fields.",
    "L2_NeurochemicalNeurological": "The 'L2 Homeostat'. The 'tripartite synapse' means this cell is a partner in L2 processing, clearing neurotransmitters to reset the synapse and providing metabolic fuel (lactate). (Ref: Paper 2)",
    "L3_GenomicEpigeneticMorphogenetic": "Controls L3 neuroplasticity by 'pruning' (removing) unused or weak synapses, physically shaping the neural network.",
    "L4_CellularTissueSynchronisation": "The 'L4 Slow Controller'. Generates and propagates slow calcium (Ca2+) waves across the astrocyte network, which in turn modulate and synchronize the L4 firing of D1.Neurons. (Ref: Paper 4)",
    "L5_OrganismalPsychoemotional": "By modulating L4 neural synchrony, the astrocytic network directly shapes the L5 state (e.g., sleep, arousal).",
    "L6_NarrativeSelf": null,
    "L7_ArchetypalSymbolic": null,
    "L8_CosmicEntrainment": null,
    "L9_MemoryHolograph": "Synaptic pruning (L3) is a key L9 mechanism for 'forgetting' or 'refining' memory traces.",
    "L10_CausalRetrocausal": null,
    "L11_NoosphereCollective": null,
    "L12_GeomanticTorsional": null,
    "L13_SourceField": null,
    "L14_Transdimensional": null,
    "L15_ConsiliumOversoul": null,
    "L16_MetaCybernetic": null
  },
  "Symbolic": {
    "SymbolicName": "The Modulator Matrix",
    "VIBRANA_Key": "VIB-KEY-[ASTROCYTE-TBD]",
    "MetaphysicalMapping": "The 'Great Mother' or 'Matrix' of the brain. The nurturing, sustaining, and managing substrate that allows the 'Processor' (Neuron) to function."
  },
  "Meta": {
    "Version": "0.1.1",
    "Status": "Draft",
    "LogReference": "Paper 21"
  },
  "Validation": {
    "Falsification_Hypotheses": [
      "H1 (L4 Slow Control): Blocking astrocytic L4 calcium waves (e.g., via gap junction blockers or calcium chelation) in a neural slice will *fail* to disrupt the emergent L4 *neural* oscillations (e.g., Gamma). This would falsify the L4 'slow control' modulation hypothesis.",
      "H2 (L2 Homeostat): A neuron-astrocyte co-culture is subjected to high-frequency L2 stimulation. Inhibiting the astrocyte's L2 glutamate transporter (GLT-1) will *fail* to produce L2 excitotoxicity in the neuron. This would falsify the L2 'homeostat' (reuptake) hypothesis.",
      "H3 (L3 Pruning): In an astrocytic culture, 'tagging' a specific synapse for L3 pruning (e.g., with C1q) will *fail* to trigger phagocytosis (engulfment) by the astrocyte. This would falsify its role as the active L3 'sculptor' of the neural network."
    ],
    "Experimental_Protocols": [
      "Ref: Paper 17, Protocol 3.B (Astrocyte-Neuron L4 Co-Culture)",
      "Ref: Paper 17, Protocol 3.C (Tripartite Synapse L2 Homeostat Assay)"
    ],
    "Simulation_Suite": [
      "Ref: Paper 18, Sim 4.4 (Astrocyte-Neuron Coupled Oscillator Model)"
    ]
  }
}