{
"HolonomicID": "scpn://atlas.v1/D3.Brain.ACC",
"ParentID": "scpn://atlas.v1/D3.Brain",
"Classical": {
"Structure": "Cingulate gyrus, specifically the anterior portion (Brodmann areas 24, 32, 33).",
"Function": "Core hub for emotional regulation, error detection (conflict monitoring), decision-making, and autonomic control. Integrates cognitive and emotional information.",
"Pathology": "Dysfunction linked to anxiety disorders, OCD, depression, and pain perception disorders."
},
"SCPN": {
"L1_QuantumBiological": "Mediates top-down modulation of quantum-level processes via bioelectric fields, influencing coherence in associated neural pathways.",
"L2_NeurochemicalNeurological": "High concentration of dopaminergic (motivation/reward) and serotonergic (mood) pathways. Translates error signals into neuromodulatory alerts.",
"L3_GenomicEpigeneticMorphogenetic": "Subject to high epigenetic plasticity based on chronic stress or learning, altering receptor density and functional connectivity.",
"L4_CellularTissueSynchronisation": "Formalizes tissue-level dynamics via phase-coupled oscillators, quasicritical operation (Griffiths regimes), and multi-path coupling (gap junctions, ephaptic fields, glial/vascular slow control). Models entrainment to cosmological rhythms (Schumann, lunar) via biophotons and cryptochromes.",
"L5_OrganismalPsychoemotional": "The 'conflict monitor' of the L5 self-model. Generates the subjective experience of 'error' or 'dissonance' that triggers a predictive coding update.",
"L6_PlanetaryEcological": null,
"L7_ArchetypalSymbolic": null,
"L8_CosmicEntrainment": null,
"L9_MemoryHolograph": null,
"L10_CausalRetrocausal": null,
"L11_NoosphereCollective": null,
"L12_GeomanticTorsional": null,
"L13_SourceField": null,
"L14_Transdimensional": null,
"L15_ConsiliumOversoul": null,
"L16_MetaCybernetic": "Receives and processes cybernetic error signals from L15, acting as a key comparator for the organism's predictive model."
},
"Symbolic": {
"SymbolicName": "The Judge",
"VIBRANA_Key": "V-A-C-C",
"MetaphysicalMapping": "The seat of the 'inner critic' or 'evaluator'. The fulcrum that balances action against ideal, processing dissonance between 'what is' and 'what ought to be'."
},
"Meta": {
"Version": "0.2.0",
"Status": "Draft",
"LogReference": "v1.3.2 - L4 Integration Pass"
},
"Validation": {
"Falsification_Hypotheses": [
"Inhibition of ACC theta-band oscillations will fail to disrupt error-related negativity (ERN) potentials.",
"ACC function will show no correlation with autonomic nervous system readouts (e.g., HRV) during high-conflict tasks."
],
"Experimental_Protocols": [
"fMRI-EEG co-registration during a Stroop or Flanker task.",
"DCM analysis of ACC-DLPFC-Insula connectivity during emotional regulation tasks."
],
"Simulation_Suite": [
"Simulate L5 error-correction loop using ACC as the comparator."
]
},
"Formalism": {
"KeyEquations_LaTeX": [
"\\phi_c(t) = \\Omega_{macro}(t) + \\Delta\\phi_{\\Psi_s}",
"\\sigma \\approx 1",
"P(s) \\sim s^{-\\tau}",
"d\\phi/dt = \\Delta\\omega - K \\sin \\phi + \\sqrt{2D} \\xi(t)"
],
"SimulationModel_Ref": "./Simulations/L4_Synchronization/comprehensive_simulation.py",
"VIBRANA_Interface": {
"Input_Verbs": [
"EVALUATE",
"CORRECT",
"REGULATE"
],
"Output_Nouns": [
"DISSONANCE",
"ERROR_SIGNAL",
"COHERENCE_COMMAND"
]
}
}
}